src/DataProcessors/ЗакрытиеСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ЗакрытиеСмены</Name>
			<Comment>Закрытие кассовой смены</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата закрытия кассовой смены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КассыККМ</Name>
					<Comment>Таблица закрываемых касс ККМ</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Comment>Признак закрытия смены кассы ККМ</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Comment>Закрываемая касса ККМ</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Оборудование, используемое при закрытии смены</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Comment>Признак закрытия смены оборудования</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Comment>Оборудование</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Comment>Рабочее место</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОборудования</Name>
							<Comment>Класс оборудования</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОборотыПоФР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродаж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозвратов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НепробитыеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.Чек</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоВозврат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НепроведенныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.Чек</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ВариантыОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтветов</Name>
			<Comment>Используется в правах-настройках пользователей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спрашивать</Name>
					<Comment>Будет открыт диалог на выбор варианта: "Да" - выполнить действие "Нет" - отменить действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
					<Comment>Данное право (настройка) разрешает действие пользователю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
					<Comment>Данное право (настройка) запрещает действие пользователю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьWebСервисОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рарус</Name>
					<Comment>Rarus</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКМ5</Name>
					<Comment>Сарабеев</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/КассыККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>КассыККМ</Name>
			<Comment>Кассы контрольно-кассовых машин</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Comment>Валюта, в которой работает ККМ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Оборудование</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерPOS</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ЗакрытиеСмены/Forms/Форма/Ext/Form/Module.bsl
// Модуль основной формы обработки "Закрытие смены"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ЗАКРЫТИЯ СМЕНЫ

// Выполняет закрытие смены торговой точки
&НаКлиенте
Процедура ВыполнитьЗакрытиеСмены(Команда)
	
	ЭтотОбъект.Модифицированность = ЛОЖЬ;
	
	// Проверим возможность выполнения закрытия смены
	Если НЕ ПроверитьВозможностьЗакрытияСмены() Тогда
		Возврат;
	КонецЕсли;
		
	// Выполнение свертки чеков ...
	Если НЕ ВыполнитьСверткуЧеков() Тогда
		Возврат;
	КонецЕсли;
	
	// Выполнение закрытия смены фискальных регистраторов ...
	Если НЕ ВыполнитьЗакрытиеСменыФискальныхРегистраторов() Тогда
		Возврат;
	КонецЕсли;
	
	// Выполнение закрытия смены авторизаторов ...
	Если НЕ ВыполнитьЗакрытиеСменыАвторизаторов() Тогда
		Возврат;
	КонецЕсли;
	
	// Выполнение регламентных операций ...
	Если НЕ ВыполнитьРегламентныеОперации() Тогда
		Возврат;
	КонецЕсли;
	
	// Если все операции выполнены успешно, то закрываем форму
	ЭтотОбъект.Закрыть(ИСТИНА);
	
КонецПроцедуры // ВыполнитьЗакрытиеСмены()

&НаСервере
Процедура ПроверитьВозможностьИнкассации(Отказ)
	
	Для каждого СтрокаТаблицыКассККМ Из Объект.КассыККМ.НайтиСтроки(Новый Структура("Использовать", 1)) Цикл
		
		ПодразделениеКомпании    = СтрокаТаблицыКассККМ.КассаККМ.ПодразделениеКомпании;
		ОсновнойИнкассатор       = ПодразделениеКомпании.ОсновнойИнкассатор;
		ОсновнаяПлатежнаяСистема = ПодразделениеКомпании.ОсновнаяПлатежнаяСистема;
		
		Если НЕ ЗначениеЗаполнено(ОсновнойИнкассатор) Тогда
			ВывестиСообщение(НСтр("ru='В параметрах подразделения %1 кассы ККМ %1 не задан Инкассатор'"), Объект, "КассыККМ[#].КассаККМ", СтрокаТаблицыКассККМ.НомерСтроки, Отказ, ПодразделениеКомпании, СтрокаТаблицыКассККМ.КассаККМ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ОсновнаяПлатежнаяСистема) Тогда
			ВывестиСообщение(НСтр("ru='В параметрах подразделения %1 кассы ККМ %1 не задана Платежная система'"), Объект, "КассыККМ[#].КассаККМ", СтрокаТаблицыКассККМ.НомерСтроки,, ПодразделениеКомпании, СтрокаТаблицыКассККМ.КассаККМ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьВозможностьИнкассации()

&НаКлиенте
Функция ПроверитьВозможностьЗакрытияСмены()
	
	Отказ = ЛОЖЬ;
	
	// Проверим, что там отметил пользователь
	Если Объект.КассыККМ.НайтиСтроки(Новый Структура("Использовать", 1)).Количество()=0 И Объект.Оборудование.НайтиСтроки(Новый Структура("Использовать", 1)).Количество()=0 Тогда
		ВывестиСообщение(НСтр("ru = 'Не выбрана касса ККМ или оборудование, на которых выполняется закрытие смены.'"), Объект, "КассаККМ",, Отказ);
	КонецЕсли;
	
	// Проверим нужно ли выполнять инкассацию
	ПроверитьВозможностьИнкассации(Отказ);
	
	// Возвращаем результат завершения операции
	Возврат (НЕ Отказ);
	
КонецФункции // ПроверитьВозможностьЗакрытияСмены()


&НаСервере
Функция ВыполнитьСверткуЧеков()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЧекиККМ.КассаККМ КАК КассаККМ,
	|	ЧекиККМ.Документ КАК Документ,
	|	ЧекиККМ.ЭтоВозврат КАК ЭтоВозврат,
	|	ЧекиККМ.Контрагент КАК Контрагент,
	|	ЧекиККМ.Карточка КАК Карточка,
	|	ЧекиККМ.СкидкаНаценка КАК СкидкаНаценка,
	|	ЧекТовары.Номенклатура КАК Номенклатура,
	|	ЧекТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЧекТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЧекТовары.Коэффициент КАК Коэффициент,
	|	ЧекТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЧекТовары.СкидкаНаТовар КАК СкидкаНаТовар,
	|	ЧекТовары.МестоРазмещения КАК МестоРазмещения,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.Количество
	|	КОНЕЦ КАК КоличествоПродано,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоВозврат,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.СуммаНДС
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.СуммаСкидки
	|	КОНЕЦ КАК СуммаСкидки,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.СуммаСкидкиСтроки
	|	КОНЕЦ КАК СуммаСкидкиСтроки,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.СуммаВсего
	|	КОНЕЦ КАК СуммаВсего,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА 0
	|		ИНАЧЕ ЧекТовары.Количество
	|	КОНЕЦ * ЧекТовары.Коэффициент КАК КоличествоНоменклатуры,
	|	ЧекиККМ.КоличествоЧеков КАК КоличествоЧеков,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВозврата,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДСВозврата,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.СуммаСкидки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСкидкиВозврата,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.СуммаСкидкиСтроки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСкидкиСтрокиВозврата,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.СуммаВсего
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВсегоВозврата,
	|	ВЫБОР
	|		КОГДА ЧекиККМ.ЭтоВозврат
	|			ТОГДА ЧекТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ * ЧекТовары.Коэффициент КАК КоличествоНоменклатурыВозврата,
	|	ЧекиККМ.НомерФискальногоЧека КАК НомерФискальногоЧека,
	|	ЧекиККМ.ДатаРеализации КАК ДатаРеализации
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	(ВЫБРАТЬ
	|		Документы.КассаККМ КАК КассаККМ,
	|		Документы.ФР КАК ФР,
	|		Документы.Документ КАК Документ,
	|		Документы.Дата КАК Дата,
	|		Документы.Проведен КАК Проведен,
	|		Документы.ЭтоВозврат КАК ЭтоВозврат,
	|		Документы.ЭтоПродажа КАК ЭтоПродажа,
	|		Документы.Пробит КАК Пробит,
	|		Документы.КоличествоЧеков КАК КоличествоЧеков,
	|		Документы.СуммаПродаж КАК СуммаПродаж,
	|		Документы.СуммаДокумента КАК СуммаДокумента,
	|		Документы.Контрагент КАК Контрагент,
	|		Документы.Карточка КАК Карточка,
	|		Документы.СкидкаНаценка КАК СкидкаНаценка,
	|		Документы.НомерФискальногоЧека КАК НомерФискальногоЧека,
	|		Документы.ДатаРеализации КАК ДатаРеализации
	|	ИЗ
	|		Документы КАК Документы
	|	ГДЕ
	|		Документы.Проведен
	|		И Документы.ЭтоПродажа) КАК ЧекиККМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Чек.Товары КАК ЧекТовары
	|		ПО ЧекиККМ.Документ = ЧекТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Документы.Дата КАК Дата
	|ИЗ
	|	Документы КАК Документы
	|ГДЕ
	|	Документы.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документы.КассаККМ КАК КассаККМ,
	|	ВЫБОР
	|		КОГДА НЕ ЧекОплаты.ТипОплаты ЕСТЬ NULL
	|			ТОГДА ЧекОплаты.ТипОплаты
	|		КОГДА НЕ ЧекНаОплатуОплаты.ТипОплаты ЕСТЬ NULL
	|			ТОГДА ЧекНаОплатуОплаты.ТипОплаты
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТипыОплат.Наличные)
	|	КОНЕЦ КАК ТипОплаты,
	|	ВЫБОР
	|		КОГДА НЕ ЧекОплаты.ТипПлатежнойКарты ЕСТЬ NULL
	|			ТОГДА ЧекОплаты.ТипПлатежнойКарты
	|		КОГДА НЕ ЧекНаОплатуОплаты.ТипПлатежнойКарты ЕСТЬ NULL
	|			ТОГДА ЧекНаОплатуОплаты.ТипПлатежнойКарты
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ТипыПлатежныхКарт.ПустаяСсылка)
	|	КОНЕЦ КАК ТипПлатежнойКарты,
	|	ВЫБОР
	|		КОГДА НЕ ЧекОплаты.Карточка ЕСТЬ NULL
	|			ТОГДА ЧекОплаты.Карточка
	|		КОГДА НЕ ЧекНаОплатуОплаты.Карточка ЕСТЬ NULL
	|			ТОГДА ЧекНаОплатуОплаты.Карточка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Карточки.ПустаяСсылка)
	|	КОНЕЦ КАК Карточка,
	|	ВЫБОР
	|		КОГДА НЕ ЧекОплаты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЧекОплаты.Контрагент
	|		КОГДА НЕ ЧекНаОплатуОплаты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЧекНаОплатуОплаты.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ ЧекОплаты.ДоговорВзаиморасчетов ЕСТЬ NULL
	|			ТОГДА ЧекОплаты.ДоговорВзаиморасчетов
	|		КОГДА НЕ ЧекНаОплатуОплаты.ДоговорВзаиморасчетов ЕСТЬ NULL
	|			ТОГДА ЧекНаОплатуОплаты.ДоговорВзаиморасчетов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА Документы.ЭтоПродажа
	|			ТОГДА Документы.КоличествоЧеков
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЧеков,
	|	ВЫБОР
	|		КОГДА Документы.ЭтоВозврат
	|				ИЛИ НЕ Документы.ЭтоПродажа
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ЧекОплаты.Сумма, 0) - ЕСТЬNULL(ЧекОплаты.Сдача, 0)
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА НЕ Документы.ЭтоВозврат
	|				ИЛИ НЕ Документы.ЭтоПродажа
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ЧекОплаты.Сумма, 0) - ЕСТЬNULL(ЧекОплаты.Сдача, 0)
	|	КОНЕЦ КАК СуммаВозврат,
	|	ВЫБОР
	|		КОГДА НЕ Документы.ЭтоПродажа
	|			ТОГДА Документы.КоличествоЧеков
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЧековОплата,
	|	ВЫБОР
	|		КОГДА Документы.ЭтоВозврат
	|				ИЛИ Документы.ЭтоПродажа
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ЧекНаОплатуОплаты.Сумма, Документы.СуммаДокумента) - ЕСТЬNULL(ЧекНаОплатуОплаты.Сдача, 0)
	|	КОНЕЦ КАК СуммаОплата,
	|	ВЫБОР
	|		КОГДА НЕ Документы.ЭтоВозврат
	|				ИЛИ Документы.ЭтоПродажа
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ЧекНаОплатуОплаты.Сумма, Документы.СуммаДокумента) - ЕСТЬNULL(ЧекНаОплатуОплаты.Сдача, 0)
	|	КОНЕЦ КАК СуммаВозвратОплата,
	|	ВЫБОР
	|		КОГДА Документы.ЭтоВозврат
	|			ТОГДА Документы.КоличествоЧеков
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЧековВозврат
	|ПОМЕСТИТЬ Оплаты
	|ИЗ
	|	Документы КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Чек.Оплаты КАК ЧекОплаты
	|		ПО Документы.Документ = ЧекОплаты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекНаОплату.Оплаты КАК ЧекНаОплатуОплаты
	|		ПО Документы.Документ = ЧекНаОплатуОплаты.Ссылка
	|ГДЕ
	|	Документы.Проведен
	|	И Документы.НеУчтен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Коэффициент КАК Коэффициент,
	|	Товары.МестоРазмещения КАК МестоРазмещения,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(0) КАК КоличествоПродано,
	|	СУММА(0) КАК КоличествоВозврат,
	|	СУММА(Товары.КоличествоПродано) КАК Количество,
	|	СУММА(Товары.Сумма) КАК Сумма,
	|	СУММА(Товары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Товары.СуммаСкидки + Товары.СуммаСкидкиСтроки) КАК СуммаСкидки,
	|	СУММА(Товары.СуммаВсего) КАК СуммаВсего,
	|	СУММА(Товары.КоличествоЧеков) КАК КоличествоЧеков
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.КоличествоПродано <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.Коэффициент,
	|	Товары.МестоРазмещения,
	|	Товары.ХарактеристикаНоменклатуры,
	|	Товары.СтавкаНДС
	|
	|УПОРЯДОЧИТЬ ПО
	|	МестоРазмещения,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	Коэффициент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Оплаты.КассаККМ КАК Касса,
	|	Оплаты.ТипОплаты КАК ТипОплаты,
	|	Оплаты.ТипПлатежнойКарты КАК ТипПлатежнойКарты,
	|	Оплаты.Карточка КАК Карточка,
	|	Оплаты.Контрагент КАК Контрагент,
	|	Оплаты.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	СУММА(Оплаты.КоличествоЧеков) КАК КоличествоЧеков,
	|	СУММА(Оплаты.Сумма) КАК Сумма,
	|	СУММА(0) КАК СуммаВозврат,
	|	СУММА(Оплаты.КоличествоЧековОплата) КАК КоличествоЧековОплата,
	|	СУММА(Оплаты.СуммаОплата) КАК СуммаОплата,
	|	СУММА(0) КАК СуммаВозвратОплата
	|ИЗ
	|	Оплаты КАК Оплаты
	|ГДЕ
	|	НЕ(Оплаты.Сумма = 0
	|				И Оплаты.СуммаОплата = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Оплаты.КассаККМ,
	|	Оплаты.ТипОплаты,
	|	Оплаты.ТипПлатежнойКарты,
	|	Оплаты.Карточка,
	|	Оплаты.Контрагент,
	|	Оплаты.ДоговорВзаиморасчетов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Оплаты.КассаККМ,
	|	ТипОплаты,
	|	ТипПлатежнойКарты,
	|	Карточка,
	|	Контрагент,
	|	ДоговорВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Скидки.СкидкаНаценка КАК СкидкаНаценка,
	|	СУММА(Скидки.Сумма) КАК Сумма,
	|	СУММА(Скидки.СуммаСкидки) КАК СуммаСкидки,
	|	СУММА(Скидки.СуммаВсего) КАК СуммаВсего,
	|	Скидки.Карточка КАК Карточка,
	|	СУММА(Скидки.КоличествоЧеков) КАК КоличествоЧеков
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.СкидкаНаценка КАК СкидкаНаценка,
	|		Товары.Сумма - Товары.СуммаВозврата КАК Сумма,
	|		Товары.СуммаСкидки - Товары.СуммаСкидкиВозврата КАК СуммаСкидки,
	|		Товары.СуммаВсего - Товары.СуммаВозврата КАК СуммаВсего,
	|		Товары.Карточка КАК Карточка,
	|		Товары.КоличествоЧеков КАК КоличествоЧеков
	|	ИЗ
	|		Товары КАК Товары
	|	ГДЕ
	|		НЕ Товары.СкидкаНаценка = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.ПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Товары.СкидкаНаТовар,
	|		Товары.Сумма - Товары.СуммаВозврата,
	|		Товары.СуммаСкидкиСтроки - Товары.СуммаСкидкиСтрокиВозврата,
	|		Товары.СуммаВсего - Товары.СуммаВсегоВозврата,
	|		Товары.Карточка,
	|		Товары.КоличествоЧеков
	|	ИЗ
	|		Товары КАК Товары
	|	ГДЕ
	|		НЕ Товары.СкидкаНаТовар = ЗНАЧЕНИЕ(Справочник.ТипыСкидок.ПустаяСсылка)) КАК Скидки
	|
	|СГРУППИРОВАТЬ ПО
	|	Скидки.СкидкаНаценка,
	|	Скидки.Карточка
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкидкаНаценка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Контрагент КАК Контрагент,
	|	Товары.Карточка КАК Карточка,
	|	СУММА(Товары.Сумма) КАК Сумма,
	|	СУММА(Товары.СуммаСкидки + Товары.СуммаСкидкиСтроки - Товары.СуммаСкидкиВозврата - Товары.СуммаСкидкиСтрокиВозврата) КАК СуммаСкидки,
	|	СУММА(Товары.СуммаВсего - Товары.СуммаВсегоВозврата) КАК СуммаВсего,
	|	СУММА(ВЫБОР
	|			КОГДА Товары.ЭтоВозврат
	|				ТОГДА -Товары.КоличествоЧеков
	|			ИНАЧЕ Товары.КоличествоЧеков
	|		КОНЕЦ) КАК КоличествоЧеков,
	|	СУММА(Товары.КоличествоНоменклатуры) КАК КоличествоНоменклатуры
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Контрагент,
	|	Товары.Карточка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Карточка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.КассаККМ КАК КассаККМ,
	|	ЧекДополнительныеРеквизиты.Значение КАК Свойство,
	|	СУММА(Товары.Сумма) КАК Сумма,
	|	СУММА(Товары.СуммаСкидки + Товары.СуммаСкидкиСтроки) КАК СуммаСкидки,
	|	СУММА(Товары.СуммаВсего) КАК СуммаВсего,
	|	СУММА(Товары.КоличествоЧеков) КАК КоличествоЧеков
	|ИЗ
	|	Товары КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Чек.ДополнительныеРеквизиты КАК ЧекДополнительныеРеквизиты
	|		ПО Товары.Документ = ЧекДополнительныеРеквизиты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.КассаККМ,
	|	ЧекДополнительныеРеквизиты.Значение
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассаККМ,
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документы.Документ КАК Документ
	|ИЗ
	|	Документы КАК Документы
	|ГДЕ
	|	Документы.ЭтоПродажа
	|	И Документы.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Коэффициент КАК Коэффициент,
	|	Товары.МестоРазмещения КАК МестоРазмещения,
	|	Товары.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(Товары.КоличествоВозврат) КАК Количество,
	|	СУММА(Товары.СуммаВозврата) КАК Сумма,
	|	СУММА(Товары.СуммаНДСВозврата) КАК СуммаНДС,
	|	СУММА(Товары.СуммаСкидкиВозврата + Товары.СуммаСкидкиСтрокиВозврата) КАК СуммаСкидки,
	|	СУММА(Товары.СуммаВсегоВозврата) КАК СуммаВсего,
	|	СУММА(Товары.КоличествоЧеков) КАК КоличествоЧеков,
	|	Товары.НомерФискальногоЧека КАК НомерФискальногоЧека,
	|	Товары.ДатаРеализации КАК ДатаРеализации
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.КоличествоВозврат <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.ЕдиницаИзмерения,
	|	Товары.Коэффициент,
	|	Товары.МестоРазмещения,
	|	Товары.ХарактеристикаНоменклатуры,
	|	Товары.СтавкаНДС,
	|	Товары.НомерФискальногоЧека,
	|	Товары.ДатаРеализации
	|
	|УПОРЯДОЧИТЬ ПО
	|	МестоРазмещения,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	Коэффициент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Оплаты.КассаККМ КАК Касса,
	|	Оплаты.ТипОплаты КАК ТипОплаты,
	|	Оплаты.ТипПлатежнойКарты КАК ТипПлатежнойКарты,
	|	Оплаты.Карточка КАК Карточка,
	|	Оплаты.Контрагент КАК Контрагент,
	|	Оплаты.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	СУММА(Оплаты.КоличествоЧековВозврат) КАК КоличествоЧеков,
	|	СУММА(Оплаты.СуммаВозврат) КАК Сумма,
	|	СУММА(Оплаты.КоличествоЧековОплата) КАК КоличествоЧековОплата,
	|	СУММА(Оплаты.СуммаВозвратОплата) КАК СуммаОплата
	|ИЗ
	|	Оплаты КАК Оплаты
	|ГДЕ
	|	НЕ(Оплаты.СуммаВозврат = 0
	|				И Оплаты.СуммаВозвратОплата = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	Оплаты.КассаККМ,
	|	Оплаты.ТипОплаты,
	|	Оплаты.ТипПлатежнойКарты,
	|	Оплаты.Карточка,
	|	Оплаты.Контрагент,
	|	Оплаты.ДоговорВзаиморасчетов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Оплаты.КассаККМ,
	|	ТипОплаты,
	|	ТипПлатежнойКарты,
	|	Карточка,
	|	Контрагент,
	|	ДоговорВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Оплаты";
	
	// Обработаем каждое оборудование в отдельности
	Для каждого СтрокаТабличнойЧасти Из Объект.КассыККМ.НайтиСтроки(Новый Структура("Использовать", 1)) Цикл
		
		// Каждое закрытие смены будем производить в отдельной транзакции
		НачатьТранзакцию();
		
		// Заблокируем сворачиваемые документы по текущей кассе ККМ
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.Чек");
		ЭлементБлокировки.УстановитьЗначение("КассаККМ", СтрокаТабличнойЧасти.КассаККМ);
		ЭлементБлокировки.УстановитьЗначение("Архивный", ЛОЖЬ);
		ЭлементБлокировки = Блокировка.Добавить("Документ.ЧекНаОплату");
		ЭлементБлокировки.УстановитьЗначение("КассаККМ", СтрокаТабличнойЧасти.КассаККМ);
		Блокировка.Заблокировать();
		
		// Выполним запрос и получим пакет результатов
		Запрос = Документы.ЗакрытиеСмены.ПолучитьЗапросПоИтогамСмены(Объект, ТекстЗапроса, СтрокаТабличнойЧасти.КассаККМ);
		РезультатыПакета = Запрос.ВыполнитьПакет();
		
		// Проверим, имеется хотя бы один документ в результирующей выборке
		Выборка = РезультатыПакета[3].Выбрать();
		Если НЕ Выборка.Следующий() Тогда
			ВывестиСообщение(НСтр("ru = 'При закрытии смены на кассе %1 не обнаружено проведенных документов.'"), Объект, "КассыККМ[#].КассаККМ", СтрокаТабличнойЧасти.НомерСтроки,, СтрокаТабличнойЧасти.КассаККМ);
			Продолжить;
		КонецЕсли;
		
		// Создаем объект документа и производим его заполнение
		ЗакрытиеСмены = Документы.ЗакрытиеСмены.СоздатьДокумент();
		ЗакрытиеСмены.ХозОперация             = Справочники.ХозОперации.ЗакрытиеСмены;
		ЗакрытиеСмены.Дата                    = Объект.Дата;
		ЗакрытиеСмены.КассаККМ                = СтрокаТабличнойЧасти.КассаККМ;
		ЗакрытиеСмены.ДатаПоследнегоДокумента = Выборка.Дата;
		ЗакрытиеСмены.Заполнить(Неопределено);
		
		// Заполним сведения о товарах и об оплатах
		Документы.ЗакрытиеСмены.ЗаполнитьТабличныеЧастиДокумента(ЗакрытиеСмены, РезультатыПакета);
		
		// Произведем свертку чеков информационной базы
		Если НЕ ВыполнитьАрхивациюЧеков(РезультатыПакета[10].Выбрать()) Тогда
			ОтменитьТранзакцию();
			Продолжить;
		КонецЕсли;
		
		Попытка
			ЗакрытиеСмены.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ВывестиСообщение(НСтр("ru = 'При проведении документа закрытия смены на кассе %1 возникли ошибки. Операция отменена.'"), Объект, "КассыККМ[#].КассаККМ", СтрокаТабличнойЧасти.НомерСтроки,, СтрокаТабличнойЧасти.КассаККМ);
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецПопытки;
			
		// Формируем денежные документы
		Если НЕ ВыполнитьСозданиеДокументовИнкассации(ЗакрытиеСмены, СтрокаТабличнойЧасти.НомерСтроки) Тогда
			ОтменитьТранзакцию();
			Продолжить;
		КонецЕсли;

		ЗафиксироватьТранзакцию();
		
		// Обработка текущей кассы успешно завершена
		СтрокаТабличнойЧасти.Использовать = 0;
		
	КонецЦикла;
	
	// Возвращаем признак успешного завершения операции
	Возврат ИСТИНА;
	
КонецФункции // ВыполнитьСверткуЧеков()

&НаСервере
Функция ВыполнитьСозданиеДокументовИнкассации(ЗакрытиеСмены, НомерСтроки)
	
	// Получим остатки по кассе ККМ
	ОстаткаПоКассеККМ = Документы.Инкассация.ПолучитьОстатокПоКассеККМ(ЗакрытиеСмены.КассаККМ, ЗакрытиеСмены.Дата);
	
	// Создаем документ Инкассация
	Инкассация = Документы.Инкассация.СоздатьДокумент();
	Инкассация.ХозОперация           = Справочники.ХозОперации.ИзъятиеИзКассыККМ;
	Инкассация.Дата                  = ЗакрытиеСмены.Дата+1;
	Инкассация.КассаККМ              = ЗакрытиеСмены.КассаККМ;
	Инкассация.ПодразделениеКомпании = ЗакрытиеСмены.ПодразделениеКомпании;
	
	Инкассация.Заполнить(ЗакрытиеСмены.Ссылка);
	
	Инкассация.Оплаты.Очистить();
	
	// Запишем сумму инкассации в документ
	Для каждого СтрокаОстаткиККМ Из ОстаткаПоКассеККМ Цикл
		Если СтрокаОстаткиККМ.Сумма <> 0 ИЛИ СтрокаОстаткиККМ.СуммаВозврат <> 0 Тогда
			НоваяСтрока = Инкассация.Оплаты.Добавить();
			НоваяСтрока.ТипОплаты    = СтрокаОстаткиККМ.ТипОплаты;
			НоваяСтрока.Сумма        = СтрокаОстаткиККМ.Сумма;
			НоваяСтрока.СуммаВозврат = СтрокаОстаткиККМ.СуммаВозврат;
		КонецЕсли;
	КонецЦикла;
	
	// Проведем документ инкассации
	Попытка
		Инкассация.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ВывестиСообщение(НСтр("ru = 'При проведении документа инкассации на кассе %1 возникли ошибки. Операция отменена.'"), Объект, "КассыККМ[#].КассаККМ", НомерСтроки,, ЗакрытиеСмены.КассаККМ);
		ПричинаОшибки(Инкассация);
		Возврат ЛОЖЬ;
	КонецПопытки;
	
	// Проверим нужно ли создать ПКО
	Если НЕ ПравоПользователя("СоздаватьПКОПриЗакрытииКассовойСмены") Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Создаем документ ПКО
	ПриходныйКассовыйОрдер = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	ПриходныйКассовыйОрдер.ХозОперация = Справочники.ХозОперации.ПриходныйКассовыйОрдер;
	ПриходныйКассовыйОрдер.Дата        = Инкассация.Дата+1;
	ПриходныйКассовыйОрдер.СтатьяДДС   = Справочники.СтатьиДДС.РозничнаяВыручка;
	ПриходныйКассовыйОрдер.Заполнить(Инкассация.Ссылка);
	
	Если ПриходныйКассовыйОрдер.СуммаДокумента=0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Попробуем провести документ ПКО
	Попытка
		ПриходныйКассовыйОрдер.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ВывестиСообщение(НСтр("ru = 'При проведении документа ПКО на кассе %1 возникли ошибки. Операция отменена.'"), Объект, "КассыККМ[#].КассаККМ", НомерСтроки,, ЗакрытиеСмены.КассаККМ);
		ПричинаОшибки(ПриходныйКассовыйОрдер);
		Возврат ЛОЖЬ;
	КонецПопытки;
	
	// Возвращаем признак успешного завершения операции
	Возврат ИСТИНА;
	
КонецФункции // ВыполнитьСозданиеДокументовИнкассации()

&НаСервере
Функция ВыполнитьАрхивациюЧеков(ВыборкаПоЧекам) Экспорт
	
	// Получим право на удаление чеков после свертки
	ЧекиПослеСвертки = Константы.ЧекиПослеСвертки.Получить();
	
	Пока ВыборкаПоЧекам.Следующий() Цикл
		
		ДокументОбъект = ВыборкаПоЧекам.Документ.ПолучитьОбъект();
		
		Если ЧекиПослеСвертки=Перечисления.ВариантыОтветов.Спрашивать Тогда
			Попытка
				ДокументОбъект.Архивный = ИСТИНА;
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ВывестиСообщение(НСтр("ru = 'При архивации %1 возникла ошибка. Операция отменена.'"), Объект,,,, ВыборкаПоЧекам.Документ);
				ПричинаОшибки(ДокументОбъект);
				Возврат ЛОЖЬ;
			КонецПопытки;
		ИначеЕсли ЧекиПослеСвертки=Перечисления.ВариантыОтветов.Да Тогда
			Попытка
				ДокументОбъект.Удалить();
			Исключение
				ВывестиСообщение(НСтр("ru = 'При удалении %1 возникла ошибка. Операция отменена.'"), Объект,,,, ВыборкаПоЧекам.Документ);
				ПричинаОшибки(ДокументОбъект);
				Возврат ЛОЖЬ;
			КонецПопытки;
		ИначеЕсли ЧекиПослеСвертки=Перечисления.ВариантыОтветов.Нет Тогда
			Попытка
				ДокументОбъект.Архивный        = ИСТИНА;
				ДокументОбъект.ПометкаУдаления = ИСТИНА;
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Исключение
				ВывестиСообщение(НСтр("ru = 'При установки пометки удаления %1 возникла ошибка. Операция отменена.'"), Объект,,,, ВыборкаПоЧекам.Документ);
				ПричинаОшибки(ДокументОбъект);
				Возврат ЛОЖЬ;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	// Возвращаем признак успешного завершения операции
	Возврат ИСТИНА;
	
КонецФункции // ВыполнитьАрхивациюЧеков()

&НаКлиенте
Функция ВыполнитьЗакрытиеСменыФискальныхРегистраторов()
	
	// Обработаем каждое оборудование в отдельности
	Для каждого СтрокаТаблицыОборудования Из Объект.Оборудование.НайтиСтроки(Новый Структура("Использовать", 1)) Цикл
		
		Если НЕ (СтрокаТаблицыОборудования.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ") ИЛИ СтрокаТаблицыОборудования.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ФискальныйРегистратор"))  Тогда
			Продолжить;
		КонецЕсли;
		
		Доступность = Ложь;
		
		ПараметрыОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперации();
		// +Рарус
		Кассир = ""; ИНН = Неопределено;
		СтандартнаяОбработка = Истина;
		МенеджерОборудованияКлиентСерверПереопределяемый.ОбработкаЗаполненияИмяКассира(Кассир, ИНН, СтандартнаяОбработка); 
		ПараметрыОперации.Кассир = ?(Не СтандартнаяОбработка, Кассир, НСтр("ru='Администратор'")); 
		ПараметрыОперации.КассирИНН = ?(Не СтандартнаяОбработка, ИНН, Неопределено);  // -Рарус
		
		ПараметрыДанных = Новый Структура;
		ПараметрыДанных.Вставить("Оборудование",СтрокаТаблицыОборудования.Оборудование);
		
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ОперацияЗавершение", ЭтотОбъект,ПараметрыДанных);
		МенеджерОборудованияКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации,СтрокаТаблицыОборудования.Оборудование);

	КонецЦикла;
	
	Возврат ИСТИНА;

КонецФункции // ВыполнитьЗакрытиеСменыФискальныхРегистраторов()

&НаКлиенте
Процедура ОперацияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Доступность = Истина;
	
	ТекстСообщения = ?(РезультатВыполнения.Результат, НСтр("ru='Операция успешно завершена.'"), РезультатВыполнения.ОписаниеОшибки);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

&НаКлиенте
Функция ВыполнитьЗакрытиеСменыАвторизаторов()
	
	Отказ = ЛОЖЬ;
	
	// Обработаем каждое оборудование в отдельности
	Для каждого СтрокаТаблицыОборудования Из Объект.Оборудование.НайтиСтроки(Новый Структура("Использовать,ТипОборудования", 1, ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал"))) Цикл
	
		ОписаниеОповещения = Новый ОписаниеОповещения("ЭТ_ВыполнитьОперациюЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(ОписаниеОповещения, УникальныйИдентификатор, СтрокаТаблицыОборудования.Оборудование);

	КонецЦикла;
	
	// Возвращаем признак успешного завершения операции
	Возврат (НЕ Отказ);
	
КонецФункции // ВыполнитьЗакрытиеСменыАвторизаторов()

&НаКлиенте
Процедура ЭТ_ВыполнитьОперациюЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
		ЭТНомерСсылкиОперации = ?(РезультатВыполнения.Свойство("СсылочныйНомер"), РезультатВыполнения.СсылочныйНомер, "");
		ЭТНомерКарты = ?(РезультатВыполнения.Свойство("НомерКарты"), РезультатВыполнения.НомерКарты, "");
		ЭТНомерЧека = ?(РезультатВыполнения.Свойство("НомерЧекаЭТ"), РезультатВыполнения.НомерЧекаЭТ, "");
		ЭТКодАвторизации = ?(РезультатВыполнения.Свойство("КодАвторизации"), РезультатВыполнения.КодАвторизации, "");
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры // ЭТ_ВыполнитьОперациюЗавершени()

&НаКлиенте
Функция ВыполнитьРегламентныеОперации()
	
	// Зарезервировано
	
	// Возвращаем признак успешного завершения операции
	Возврат ИСТИНА;
	
КонецФункции // ВыполнитьРегламентныеОперации()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаСервере
Процедура ПроверитьЧекиНаСервере()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Документы.ФР
	|ИЗ
	|	Документы КАК Документы
	|ГДЕ
	|	Документы.Пробит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документы.КассаККМ КАК КассаККМ,
	|	Документы.Документ,
	|	Документы.ФР КАК ФР,
	|	Документы.Пробит,
	|	Документы.Проведен,
	|	Документы.ЭтоВозврат,
	|	Документы.СуммаДокумента
	|ИЗ
	|	Документы КАК Документы
	|ГДЕ
	|	(НЕ Документы.Проведен
	|			ИЛИ НЕ Документы.Пробит)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассаККМ,
	|	ФР";
	
	Запрос = Документы.ЗакрытиеСмены.ПолучитьЗапросПоИтогамСмены(Объект, ТекстЗапроса);
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	// Получим перечень ФР с пробитыми чеками
	ПробитыеЧеки = РезультатыЗапросов[2].Выгрузить().ВыгрузитьКолонку("ФР");
	
	Для Каждого СтрокаТаблицыОборудования Из Объект.Оборудование.НайтиСтроки(Новый Структура("ТипОборудования", ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ФискальныйРегистратор"))) Цикл
		СтрокаТаблицыОборудования.Использовать = ?(ПробитыеЧеки.Найти(СтрокаТаблицыОборудования.Оборудование)=Неопределено, 0, 1);
	КонецЦикла;
	
	// Перед заполнением таблиц, произведем их очистку
	Объект.НепробитыеДокументы.Очистить();
	Объект.НепроведенныеДокументы.Очистить();
	
	// Заполним таблицы проблемных чеков
	Выборка = РезультатыЗапросов[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Проведен И НЕ Выборка.Пробит Тогда
			НоваяСтрока = Объект.НепробитыеДокументы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;
		Если Выборка.Пробит И НЕ Выборка.Проведен Тогда
			НоваяСтрока = Объект.НепроведенныеДокументы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;
	КонецЦикла;
	
	ЭтотОбъект.Элементы.СтраницаНепробитыеДокументы   .Доступность = ИСТИНА;
	ЭтотОбъект.Элементы.СтраницаНепроведенныеДокументы.Доступность = ИСТИНА;
	
КонецПроцедуры // ПроверитьЧекиНаСервере()

&НаКлиенте
Процедура ПроверитьЧеки(Команда)
	
	ЭтотОбъект.Модифицированность = ЛОЖЬ;
	
	ПроверитьЧекиНаСервере();
	
КонецПроцедуры // ПроверитьЧеки()

// Обработчик события возникающего на клиенте при выполнении команды "Провести документы на сервере".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаСервере
Процедура ПровестиДокументыНаСервере()
	
	// Подготовим коллекцию строк, которые необходимо будет исключить из таблицы
	ИсключаемыеСтроки = Новый Массив;
	
	// Обходим все отмеченные строки
	Для Каждого СтрокаТаблицыДокументов Из Объект.НепроведенныеДокументы.НайтиСтроки(Новый Структура("Использовать", ИСТИНА)) Цикл
		
		// Пропустим те документы, которые на текущий момент оказались проведенными
		Если СтрокаТаблицыДокументов.Документ.Проведен Тогда
			ИсключаемыеСтроки.Добавить(СтрокаТаблицыДокументов);
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			// Получаем объект документа
			ДокументОбъект = СтрокаТаблицыДокументов.Документ.ПолучитьОбъект();
			
			// Снимаем пометку на удаление
			Если ДокументОбъект.ПометкаУдаления Тогда
				ДокументОбъект.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
			
			// Выполняем проведение документа
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
		Исключение
			ВывестиСообщение(НСтр("ru='При проведении %1 возникла ошибка: %2'"), Объект, "НепроведенныеДокументы[#].Документ", СтрокаТаблицыДокументов.НомерСтроки,, СтрокаТаблицыДокументов.Документ, ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		// Если добрались, сюда, значит текущая строка успешно обработана
		ИсключаемыеСтроки.Добавить(СтрокаТаблицыДокументов);
		
	КонецЦикла;
	
	// Исключим из коллекции обработанные строки
	Для каждого СтрокаТаблицыДокументов Из ИсключаемыеСтроки Цикл
		Объект.НепроведенныеДокументы.Удалить(СтрокаТаблицыДокументов);
	КонецЦикла;
	
КонецПроцедуры // ПровестиДокументыНаСервере()

// Обработчик события возникающего на клиенте при выполнении команды "Провести документы".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПровестиДокументы(Команда)
	
	ПровестиДокументыНаСервере();
	
КонецПроцедуры // ПровестиДокументы()

// Обработчик события возникающего на клиенте при выполнении команды "Пробить чеки".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПробитьЧеки(Команда)
	
	// Подготовим коллекцию строк, которые необходимо будет исключить из таблицы
	ИсключаемыеСтроки = Новый Массив;
	Оборудование      = Новый Массив;
	
	// Получим перечень использующихся фискальных регистраторов
	Для каждого СтрокаТаблицыДокументов Из Объект.НепробитыеДокументы.НайтиСтроки(Новый Структура("Использовать", ИСТИНА)) Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыДокументов.ФР) Тогда
			ВывестиСообщение(НСтр("ru='Не указан ФР'"), Объект, "НепробитыеДокументы[#].ФР", СтрокаТаблицыДокументов.НомерСтроки);
			Продолжить;
		КонецЕсли;
		
		Если Оборудование.Найти(СтрокаТаблицыДокументов.ФР)=Неопределено Тогда
			Оборудование.Добавить(СтрокаТаблицыДокументов.ФР);
		КонецЕсли;
		
	КонецЦикла;
	
	// Обходим отмеченные документы по группам ФР
	Для каждого ФР Из Оборудование Цикл
		
		ОписаниеОшибки = "";
		РезультатВключения = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(ЭтотОбъект.УникальныйИдентификатор, ФР, ОписаниеОшибки);
		Если НЕ РезультатВключения Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось включить ФР ""%1"" для пробития документов. Описание ошибки: %2'");
			ВывестиСообщение(ТекстСообщения, Объект, "НепробитыеДокументы",,, ФР, ОписаниеОшибки);
			Продолжить;
		КонецЕсли;
		
		// Подготовим параметры пробития чека
		ПараметрыПробития = Новый Структура;
		ПараметрыПробития.Вставить("ФР",             ФР);
		ПараметрыПробития.Вставить("СуммаОплатыПоЭТ", 0);
		
		Для каждого СтрокаТаблицыДокументов Из Объект.НепробитыеДокументы.НайтиСтроки(Новый Структура("Использовать,ФР", ИСТИНА, ФР)) Цикл
			
			// Выполним предварительные проверки перед пробитием
			Если НЕ СтрокаТаблицыДокументов.СуммаДокумента > 0 Тогда
				ВывестиСообщение(НСтр("ru='Не указана сумма к оплате'"), Объект, "НепробитыеДокументы[#].Документ", СтрокаТаблицыДокументов.НомерСтроки);
				Продолжить;
			КонецЕсли;
			
			// Подготовим параметры пробития текущего документа
			ПараметрыПробития.Вставить("ДокументСсылка", СтрокаТаблицыДокументов.Документ);
			ПараметрыПробития.Вставить("ЭтоВозврат",     СтрокаТаблицыДокументов.ЭтоВозврат);
			
			// Определяем переменные для возвратных параметров
			ФискальныеРеквизиты = Новый Структура;
			
			// Заказываем выполнение операции на оборудовании
			ОписаниеОшибки = "";
			РезультатПробитияНаФР = МенеджерОборудованияКлиент.ПробитьДокументПоФР(ПараметрыПробития, ФискальныеРеквизиты, ОписаниеОшибки);
			
			Если РезультатПробитияНаФР Тогда
				
				ФискальныеРеквизиты.Вставить("ФР", ФР);
				
				Если НЕ УправлениеДиалогомВызовСервера.ЗаписатьОбъект(СтрокаТаблицыДокументов.Документ, ИСТИНА, ФискальныеРеквизиты) Тогда
					ВывестиСообщение(НСтр("ru='Не удалось записать сведения о фискальных реквизитов в %1. Необходимо вручную внести данные в документ: номер чека - %2, дата чека - %3, номер смены - %4, номер документа - %5'"), Объект, "НепробитыеДокументы[#].Документ", СтрокаТаблицыДокументов.НомерСтроки,, СтрокаТаблицыДокументов.Документ, ФискальныеРеквизиты.НомерЧека, ФискальныеРеквизиты.ДатаФР, ФискальныеРеквизиты.НомерСмены, ФискальныеРеквизиты.НомерДокумента);
					Продолжить;
				КонецЕсли;
				
			Иначе
				ВывестиСообщение(НСтр("ru='Не удалось пробить на ФР ""%1"" документ %2 из-за ошибки: %3'"), Объект, "НепробитыеДокументы[#].Документ", СтрокаТаблицыДокументов.НомерСтроки,, ФР, СтрокаТаблицыДокументов.Документ, ОписаниеОшибки);
				Продолжить;
			КонецЕсли;
			
			// Если добрались, сюда, значит текущая строка успешно обработана
			ИсключаемыеСтроки.Добавить(СтрокаТаблицыДокументов);
			
		КонецЦикла;
	КонецЦикла;
	
	// Исключим из коллекции обработанные строки
	Для каждого СтрокаТаблицыДокументов Из ИсключаемыеСтроки Цикл
		Объект.НепробитыеДокументы.Удалить(СтрокаТаблицыДокументов);
	КонецЦикла;
	
КонецПроцедуры //ПробитьЧеки()

&НаСервере
Процедура АннулироватьЧекиНаСервере()
	
	// Подготовим коллекцию строк, которые необходимо будет исключить из таблицы
	ИсключаемыеСтроки = Новый Массив;
	
	// Обходим отмеченные документы
	Для каждого СтрокаТаблицыДокументов Из Объект.НепробитыеДокументы.НайтиСтроки(Новый Структура("Использовать", ИСТИНА)) Цикл
		
		Попытка
			
			// Получаем объект документа
			ДокументОбъект = СтрокаТаблицыДокументов.Документ.ПолучитьОбъект();
			
			// Установим пометку на удаление
			ДокументОбъект.УстановитьПометкуУдаления(Истина);
			
		Исключение
			ВывестиСообщение(НСтр("ru='При аннулировании чека %1 возникла ошибка: %2'"), Объект, "НепроведенныеДокументы[#].Документ", СтрокаТаблицыДокументов.НомерСтроки,, СтрокаТаблицыДокументов.Документ, ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		// Если добрались, сюда, значит текущая строка успешно обработана
		ИсключаемыеСтроки.Добавить(СтрокаТаблицыДокументов);
		
	КонецЦикла;
	
	// Исключим из коллекции обработанные строки
	Для каждого СтрокаТаблицыДокументов Из ИсключаемыеСтроки Цикл
		Объект.НепробитыеДокументы.Удалить(СтрокаТаблицыДокументов);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АннулироватьЧеки(Команда)
	
	АннулироватьЧекиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеИзменениеФлажка(Команда)
	
	ЭтотОбъект.Модифицированность = ЛОЖЬ;
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя="СтраницаКассыККМ" Тогда
		Таблица = Объект.КассыККМ;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя="СтраницаОборудование" Тогда
		Таблица = Объект.Оборудование;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя="СтраницаНепробитыеДокументы" Тогда
		Таблица = Объект.НепробитыеДокументы;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя="СтраницаНепроведенныеДокументы" Тогда
		Таблица = Объект.НепроведенныеДокументы;
	КонецЕсли;
	
	УправлениеДиалогомКлиент.ГрупповоеИзменениеПоляФлажка(Таблица, "Использовать", Команда);
	
КонецПроцедуры // ИспользованиеИзменениеФлажка()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура КассыККМВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СтрНайти(Поле.Имя, "Использовать") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Покажем текущий объект
	ПоказатьЗначение(, Элемент.ТекущиеДанные.КассаККМ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СтрНайти(Поле.Имя, "Использовать") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Покажем текущий объект
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Оборудование);
	
КонецПроцедуры

&НаКлиенте
Процедура НепробитыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СтрНайти(Поле.Имя, "Использовать") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле=Элементы.НепробитыеДокументыФР Тогда
		Возврат;
	КонецЕсли;
	
	// Покажем документ пользователю
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Документ);
	
КонецПроцедуры // НепробитыеДокументыВыбор()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Произведем кэширование значений прав
	РазрешитьЗакрытиеСменыПриРасхождениях = ПравоПользователя("РазрешитьЗакрытиеСменыПриРасхождениях");
	РазрешитьПроводитьИнкассацию          = ПравоПользователя("РазрешитьПроводитьИнкассацию");
	РазрешитьГашениеФискСчетчиков         = ПравоПользователя("РазрешитьГашениеФискСчетчиков");
	РазрешитьГашениеАвторизаторов         = ПравоПользователя("РазрешитьГашениеАвторизаторов");
	
	// Определим дату на которую необходимо выполнить закрытие смены
	Объект.Дата = ПолучитьОперативнуюОтметкуВремени();
	
	// Заполним основные таблицы
	Если ЗначениеЗаполнено(Параметры.КассаККМ) Тогда
		
		НоваяСтрока = Объект.КассыККМ.Добавить();
		НоваяСтрока.Использовать = 1;
		НоваяСтрока.КассаККМ     = Параметры.КассаККМ;
		
		Если ЗначениеЗаполнено(Параметры.ФискальныйРегистратор) Тогда
			НоваяСтрока = Объект.Оборудование.Добавить();
			НоваяСтрока.Использовать = 1;
			НоваяСтрока.Оборудование = Параметры.ФискальныйРегистратор;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.ЭквайринговыйТерминал) Тогда
			НоваяСтрока = Объект.Оборудование.Добавить();
			НоваяСтрока.Использовать = 1;
			НоваяСтрока.Оборудование = Параметры.ЭквайринговыйТерминал;
		КонецЕсли;
		
		ЭтотОбъект.Элементы.СтраницаКассыККМ    .Видимость = ЛОЖЬ;
		ЭтотОбъект.Элементы.СтраницаОборудование.Видимость = ЛОЖЬ;
		
		// Произведем анализ состояния чеков текущей смены
		ПроверитьЧекиНаСервере();
		
		// Установим признак необходимости выполнить закрытие формы после успешного завершения обработки.
		ЭтотОбъект.ЗакрыватьПриВыборе = ИСТИНА;
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Чек.КассаККМ КАК КассаККМ,
		|	Чек.ФР КАК ФР,
		|	Чек.Проведен КАК Проведен,
		|	НЕ Чек.ДатаФР = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК Пробит
		|ПОМЕСТИТЬ Документы
		|ИЗ
		|	Документ.Чек КАК Чек
		|ГДЕ
		|	НЕ Чек.Архивный
		|	И Чек.Дата <= &Дата
		|	И НЕ Чек.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекОтложенный)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Документы.КассаККМ КАК КассаККМ
		|ПОМЕСТИТЬ КассыСЧеками
		|ИЗ
		|	Документы КАК Документы
		|ГДЕ
		|	Документы.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НЕ КассыСЧеками.КассаККМ ЕСТЬ NULL КАК Использовать,
		|	КассыККМ.Ссылка КАК КассаККМ
		|ИЗ
		|	Справочник.КассыККМ КАК КассыККМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ КассыСЧеками КАК КассыСЧеками
		|		ПО КассыККМ.Ссылка = КассыСЧеками.КассаККМ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КассаККМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Документы.ФР КАК ФР
		|ИЗ
		|	Документы КАК Документы
		|ГДЕ
		|	Документы.Пробит";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		РезультатыЗапросов = Запрос.ВыполнитьПакет();
		
		// Заполним список касс ККМ
		Объект.КассыККМ.Загрузить(РезультатыЗапросов[2].Выгрузить());
		
		// Получим перечень ФР с пробитыми чеками
		ПробитыеЧеки = РезультатыЗапросов[3].Выгрузить().ВыгрузитьКолонку("ФР");
		
		МассивТиповПО = Новый Массив;
		МассивТиповПО.Добавить("ФискальныйРегистратор");
		МассивТиповПО.Добавить("ККТ");
		
		// Добавляем в список оборудования подключенные к текущему рабочему месту устройства.
		МассивДанныхФР = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(МассивТиповПО);
		
		Для Каждого ДанныеФР Из МассивДанныхФР Цикл
			НоваяСтрока = Объект.Оборудование.Добавить();
			НоваяСтрока.Использовать    = ?(ПробитыеЧеки.Найти(ДанныеФР.Ссылка)=Неопределено, 0, 1);
			НоваяСтрока.Оборудование    = ДанныеФР.Ссылка;
			НоваяСтрока.РабочееМесто    = ДанныеФР.РабочееМесто;
			НоваяСтрока.ТипОборудования = ДанныеФР.ТипОборудования;
		КонецЦикла;
		
		МассивДанныхЭТ = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам("ЭквайринговыйТерминал");
		
		Для Каждого ДанныеФР Из МассивДанныхЭТ Цикл
			НоваяСтрока = Объект.Оборудование.Добавить();
			НоваяСтрока.Использовать    = 1;
			НоваяСтрока.Оборудование    = ДанныеФР.Ссылка;
			НоваяСтрока.РабочееМесто    = ДанныеФР.РабочееМесто;
			НоваяСтрока.ТипОборудования = ДанныеФР.ТипОборудования;
		КонецЦикла;
		
		ЭтотОбъект.Элементы.СтраницаКассыККМ    .Видимость = ИСТИНА;
		ЭтотОбъект.Элементы.СтраницаОборудование.Видимость = ИСТИНА;
		
		ЭтотОбъект.ЗакрыватьПриВыборе = ЛОЖЬ;
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Произведем настройку параметров отображения кнопок командной панели списков
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "КассыККМ");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "Оборудование");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "НепробитыеДокументы");
	ЗащищенныеФункцииКлиент.НастроитьЭлементФормыТабличнойЧасти(ЭтотОбъект, "НепроведенныеДокументы");
	
КонецПроцедуры // ПриОткрытии()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
